gtgreenw/mm-iot-esp32/examples/sensor_net/sensor_unit_c6/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32c6"
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_LOG_BUFFER_SIZE=4096
CONFIG_ESP_SYSTEM_USE_EH_FRAME=y
CONFIG_LWIP_NETIF_STATUS_CALLBACK=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=30
CONFIG_ESP_INT_WDT_TIMEOUT_MS=1000

# Use a custom partition table so NVS (local logging) uses most flash.
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# Grove Capacitive Soil Moisture Sensors — default disabled. Enable in menuconfig to use.
# To add sensors: set SENSOR_MOISTURE_ENABLE=y, NUM_CHANNELS=1..4, and configure CH0_ADC etc.
# XIAO ESP32-C6 pin mapping: D0=ch0, D1=ch1, D2=ch2, D3=ch3.
CONFIG_SENSOR_MOISTURE_ENABLE=n

# BLE logging (device scan) - off by default on C6.
CONFIG_SENSOR_BLE_LOG_ENABLE=n
CONFIG_BT_ENABLED=n
CONFIG_BT_CONTROLLER_ENABLED=n
CONFIG_BT_BLE_ENABLED=n
CONFIG_BT_BLUEDROID_ENABLED=n
